package com.example.heukbaekguide.data;

import com.example.heukbaekguide.domain.MenuItem;
import com.example.heukbaekguide.domain.Restaurant;
import org.springframework.beans.factory.annotation.Autowired;
import org.springframework.stereotype.Component;

import jakarta.annotation.PostConstruct;
import jakarta.persistence.EntityManager;
import jakarta.persistence.PersistenceContext;
import jakarta.transaction.Transactional;
import java.util.List;

@Component
public class MenuItemDataInitializer {

    @PersistenceContext
    private EntityManager entityManager;

    @PostConstruct
    @Transactional
    public void insertMenuItems() {
        // MenuItem 데이터 정의
        Object[][] menuItems = {
                {"푼푼식 키마구레 코스", "77,000", 1},
                {"디너", "198,000", 2},
                {"런치", "98,000", 2},
                {"딤섬세트", "40,000", 3},
                {"티엔/미미 세트", "50,000", 3},
                {"여명 세트", "100,000", 3},
                {"만옥 세트", "150,000", 3},
                {"ppp파스타", "17,000", 4},
                {"스페차티노 디 만조", "22,000", 4},
                {"홍보각 불도장", "130,000", 5},
                {"홍보각 모자새우", "60,000", 5},
                {"MASTER CHEF’S 디너", "295,000", 6},
                {"MASTER CHEF’S 런치", "250,000", 6},
                {"CHEF CHEF’S 디너", "235,000", 6},
                {"CHEF CHEF’S 런치", "185,000", 6},
                {"카이센동", "25,000", 7},
                {"메로동", "15,000", 7},
                {"부타동", "10,000", 7},
                {"카키아게", "5,000", 7},
                {"채소테린 플레이트", "16,000", 8},
                {"호박까넬로니", "20,000", 8},
                {"가지 라쟈냐", "17,000", 8},
                {"시금치 뇨끼", "19,000", 8},
                {"새우 리조또", "24,000", 8},
                {"남도초밥 & 상추튀김텐동", "60,000", 9},
                {"남도 생선회 계절요리", "80,000~120,000", 9},
                {"남도 초밥 정식", "80,000", 9},
                {"가매런치정식", "48,000", 9},
                {"생대구탕정식", "30,000", 9},
                {"레몬타르트", "9,000", 10},
                {"피낭시에 가르니 피스타치오", "7,500", 10},
                {"메르베이유 화이트 - 레몬", "8,500", 10},
                {"과일타르트", "9,000", 10},
                {"점심 산천코스(주중)", "135,000", 11},
                {"점심 산천코스(주말/공휴일)", "160,000", 11},
                {"저녁 구학코스", "250,000", 11},
                {"사시미 모리아와세(2인)", "65,000", 12},
                {"이베리코카타로스 베요타", "28,000", 12},
                {"토마토 스키야키 한우차돌", "35,000", 12},
                {"마구로타르타르", "35,000", 12},
                {"미루가이 스미비아키", "57,000", 12},
                {"평일 점심", "50,000", 13},
                {"평일 저녁", "78,000", 13},
                {"주말/공휴일 점심", "78,000", 13},
                {"주말/공휴일 저녁", "78,000", 13},
                {"디너", "220,000", 14},
                {"런치", "78,000", 14},
                {"멘보샤", "22,000", 15},
                {"대게살볶음", "29,600", 15},
                {"깐풍기", "22,400", 15},
                {"마파두부", "17,600", 15},
                {"어향가지", "20,000", 15},
                {"이모카세 1인", "50,000", 16},
                {"손국시", "8,000", 17},
                {"수육", "12,000", 17},
                {"배추전", "8,000", 17},
                {"건진국시", "8,000", 17},
                {"비빔밥", "8,000", 17},
                {"부추전", "8,000", 17},
                {"냉콩국시", "10,000", 17},
                {"대게살볶음", "29,600", 17},
                {"깐풍기", "22,400", 17},
                {"마파두부", "17,600", 17},
                {"어햘가지", "20,000", 17},
                {"이탈리안 코스", "변동", 18},
                {"도량정식1인", "25,000", 19},
                {"팔보채", "45,000", 19},
                {"마라샹궈(소고기/양고기)", "38,000", 19},
                {"깐풍기", "30,000", 19},
                {"크림새우", "35,000", 19},
                {"칠리새우", "35,000", 19},
                {"레몬탕수육", "30,000", 19},
                {"꿔바로우", "25,000", 19},
                {"포노 브레드", "10,000", 20},
                {"야키토리 묵 오마카세 1부", "변동", 21},
                {"야키토리 묵 오마카세 2부", "변동", 21},
                {"오늘의 메뉴", "25,000", 21},
                {"안심타다끼", "4,000", 21},
                {"가슴살 명란마요", "4,000", 21},
                {"껍질", "4,000", 21},
                {"넓적다리 장작 통구이", "10,000", 21},
                {"마파두부", "18,000", 22},
                {"야끼사바차항(고등어볶음밥)", "16,000", 22},
                {"명란 포테토 사라다", "9,000", 22},
                {"스파이시유린기", "18,000", 22},
                {"에다마메 하이볼", "6,500", 22},
                {"시오야끼소바", "16,000", 22},
                {"요다레치킨", "14,000", 22},
                {"카츠 마파두부 라이스(점심특선)", "16,000", 22},
                {"카카-차항(점심특선)", "16,000", 22},
                {"에다마메", "5,000", 22},
                {"한돈 냉제육과 이달의김치", "28,000", 23},
                {"보리새우 미나리전", "20,000", 23},
                {"+후숙멜론", "변동", 23},
                {"우니와 단새우", "변동", 23},
                {"+한우우지 유부구이", "8,000", 23},
                {"매운돼지갈비와 계절나물", "28,000", 23},
                {"들기름 낙지젓 카펠리니", "23,000", 23},
                {"자연산 가리비찜과 영양부추 드레싱", "25,000", 23},
                {"황태채 강정", "6,000", 24},
                {"벌교 꼬막장", "8,000", 24},
                {"시저 샐러드", "11,000", 24},
                {"아스파라거스 새우 냉채", "10,000", 24},
                {"한우 잡채", "11,000", 24},
                {"순살 삼치구이", "10,000", 24},
                {"대삼치조림", "15,000", 24},
                {"닭다리살 숯불구이", "10,000", 24},
                {"닭다리살 간장조림", "변동", 24},
                {"돼지 김치 두루치기", "15,000", 24},
                {"한돈 김치찜", "15,000", 24},
                {"한돈 안심 돈까스", "15,000", 24},
                {"육전과 통들깨장", "11,000", 24},
                {"마마리 유린기", "변동", 24},
                {"새우전", "변동", 24},
                {"마마리 달걀말이", "7,000", 24},
                {"두부구이와 통들깨 양념장", "5,000", 24},
                {"애호박 두부 조림", "6,000", 24},
                {"닭고기 코코넛 카레", "6,800", 24},
                {"마마리 미트볼", "변동", 24},
                {"한우 강된장", "변동", 24},
                {"통들깨 무나물", "4,000", 24},
                {"마마리 시금치", "4,000", 24},
                {"매콤 국내산 콩나물무침", "3,500", 24},
                {"새우젓 애호박나물", "4,000", 24},
                {"연근 간장 조림", "4,000", 24},
                {"잣 지리멸치 볶음", "6,000", 24},
                {"매콤 어묵볶음", "5,500", 24},
                {"늙은호박", "17,000", 25},
                {"마라 전복 초 회", "19,000", 25},
                {"마늘 장아찌와 관자구이", "23,000", 25},
                {"가지튀김", "17,000", 25},
                {"프로슈토와 감자구이", "16,000", 25},
                {"청어알 비빔면", "25,000", 25},
                {"닭 튀김", "17,000", 25},
                {"이베리코 짚불 삼겹살", "38,000", 25},
                {"LA 갈비", "35,000", 25},
                {"새우", "25,000", 25},
                {"방어회", "30,000", 25},
                {"석화", "28,000", 25},
                {"동양탉", "24,000", 26},
                {"서양탉", "27,000", 26},
                {"펜킹탉", "26,000", 26},
                {"마크탉", "28,000", 26},
                {"탉간파테", "8,000", 26},
                {"탉케밥", "8,000", 26},
                {"토마토피클", "5,000", 26},
                {"완탉면", "15,000", 26},
                {"탉똥집", "13,000", 26},
                {"탉염통볶음", "13,000", 26},
                {"탉무릎연골볶음", "13,000", 26},
                {"마라비빔면", "13,000", 26},
                {"탉개장{똠얌/마라}", "5,000", 26},
                {"오목이피클", "5,000", 26},
                {"Truffle Butter&Sour Dough", "10,000", 27},
                {"마라샹궈", "27,000", 28},
                {"마라탕", "25,000", 28},
                {"라즈지", "14,000", 28},
                {"동파육", "26,000", 28},
                {"마파두부", "15,000", 28},
                {"바지락볶음", "18,000", 28},
                {"새우완탕", "14,000", 28},
                {"풍미가지", "14,000", 28},
                {"직원마라탕", "28,000", 28},
                {"클래식 치즈버거", "9,800", 29},
                {"K버거", "11,800", 29},
                {"불꽃버거", "13,800", 29},
                {"트러플 머쉬룸 버거", "14,800", 29},
                {"BB버거", "15,800", 29},
                {"베이컨 치즈 버거", "12,800", 29},
                {"페퍼로니 버거", "13,800", 29},
                {"홈메이드 어니언링", "12,000", 29},
                {"칠리 볼로네즈 프라이즈", "10,800", 29},
                {"오리지널프라이즈", "4,800", 29},
                {"카치오페페", "6,800", 29},
                {"트러플허니", "8,800", 29},
                {"코올슬로", "4,800", 29},
                {"밀크아이스크림", "4,800", 29},
                {"올리오페페", "5,800", 29},
                {"체리", "5,800", 29},
                {"아메리카노 HOT", "5,000", 29},
                {"아메리카노 ICE", "4,500", 29},
                {"하우스와인", "9,000", 29},
                {"브런치_스테이크 플래터", "38,000", 30},
                {"브런치_브런치 플래터", "28,000", 30},
                {"브런치_머쉬룸 프리카세 플래터", "28,000", 30},
                {"브런치_스테이크 샌드위치", "32,000", 30},
                {"디너{Roots}", "130,000", 31},
                {"레몬치즈파스타", "22,000", 32},
                {"트러플뇨끼", "29,000", 32},
                {"Lunch Tasting Course", "120,000", 33},
                {"Dinner Tasting Course", "200,000", 33}
        };

        for (Object[] menuItemData : menuItems) {
            String name = (String) menuItemData[0];
            String price = (String) menuItemData[1];
            Long restaurantId = Long.valueOf(menuItemData[2].toString());

            // Restaurant 참조 조회
            Restaurant restaurant = entityManager.find(Restaurant.class, restaurantId);
            if (restaurant == null) {
                System.out.printf("Restaurant ID %d not found. Skipping menu item '%s'.%n", restaurantId, name);
                continue;
            }

            // MenuItem 엔티티 생성 및 설정
            MenuItem menuItem = MenuItem.builder()
                    .menuItemName(name)
                    .menuItemPrice(price)
                    .restaurant(restaurant) // Restaurant와 연결
                    .build();

            // MenuItem 데이터 저장
            entityManager.persist(menuItem);
        }

        System.out.println("MenuItem 데이터 삽입 완료!");
    }
}

